app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_current_user##set_current_userの処理内容を定義した。
   @current_user = User.find_by(id: session[:user_id])##application.htmlで使用するため、application.htmlで定義した。