app/controllers/posts_controller.rb

  def index
  ##変数をviewファイルないで定義してきたが、railsではactionで定義することが一般的
  ##@...から始めることでactionで定義した変数をview(HTML)で使うことができる
   @posts = Post.all.order(created_at: :desc)##Post.allで表示し、投稿を作成日順（新しい順）に並び替えて@postに代入
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def show
    #@id = params[:id]#params[:id]は、routingで設定したURLの「:id」の値を取得することができる。
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def create
      @post = Post.new(content: params[:content])##Postのデータベースに新規投稿内容を保存し、それを＠postとする。
      ##new.htmlのform_tag内にあるname="content"の内容条件にし、取得する。
      if @post.save ##新規投稿に成功したかどうかで、成功→投稿一覧へ 失敗→新規投稿ページに移動し、再度編集できるようになる。
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "rewardではなく、reserveでした。\r\n失礼しますた。  "], ["created_at", "2020-08-05 14:10:39.815685"], ["updated_at", "2020-08-05 14:10:39.815685"]]

   def update
     @post = Post.find_by(id: params[:id])##Postのデータベースからidを条件に投稿内容を取得
     @post.content = params[:content] ##paramas[:content]は、edit.html.erbのcontentを取得している。これで投稿内容をデータベースに保存でき、投稿内容が更新ができる。
     if @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "rewardではなく、reserveでした。\r\n失礼しました。  "], ["updated_at", "2020-08-05 14:11:03.929192"], ["id", 12]]