app/controllers/users_controller.rb

  def index
    @users = User.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "default_user.png",##画像が表示されない。おそらく、初期画像を登録する前から登録していたユーザーに適用されていない。
      password: params[:password]
    )##新規登録時、new()内で、name,emailの入力内容、image_nameで"default_user.png"を表示する。
     if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "とら  "], ["email", "tiger@t.com  "], ["created_at", "2020-08-07 07:30:21.765962"], ["updated_at", "2020-08-07 07:30:21.765962"], ["image_name", "default_user.png"], ["password", "tiger"]]

   def update
     @user = User.find_by(id: params[:id])
     @user.name = params[:name]#edit.htmlで指定した。name属性の"name"の内容を取得している。詳細はusers/edit.htmlを参照。
     @user.email = params[:email]#edit.htmlで指定した。name属性の"email"の内容を取得している。詳細はusers/edit.htmlを参照。

     if params[:image]##画像を保存する場合の条件文
      @user.image_name = "#{@user.id}.jpg"##入力内容から取得
      image = params[:image]##name属性の"image"をimageに代入
      File.binwrite("public/user_images/#{@user.image_name}", image.read)##画像を保存することは、新たなファイルを保存することなので、Fileクラスを使う。画像を保存するので、writeではなくbinwriteを使用。第一引数：保存先、第二引数：画像を読み込むための変数
     end

     if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "email" = ?, "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", " さくら  "], ["email", " supring@g.haru.com  "], ["image_name", "8.jpg"], ["updated_at", "2020-08-06 08:39:22.146873"], ["id", 8]]